КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c3e7b9be-3656-4800-8e46-0709bd569743">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8852b0c5-f552-486c-868f-ebe8ca0b962f">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f1ffdf4f-c0b4-4011-98ad-7cf60a75cbe8">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2b1ed26b-311f-44e7-b202-264198eec52f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e0295f24-4ca7-4ca7-865f-4569012cb260">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa374108-b098-4627-8b61-2374cfa17e62">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="680ae0ca-e1f8-48ba-b136-aaa160965f42">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d371a3f9-8a6a-4f41-8820-d9a12b2d57af">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="92c5bd39-d761-43bd-97cc-896ab99e46df">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c548e8bf-5d8a-4346-ad11-7346a15a55c4">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2bb5d9e-b206-4bc7-bae0-62643128676c">
    <name>КурьерЭкспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="581369d9-44ec-4e70-98c7-55ba3307b1e9">
    <name>ДатаВремяРейсаПланПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="185053d9-9762-4036-a99d-ce89c6afcd73">
    <name>ДатаВремяРейсаПланС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="918ed87c-0276-4e11-a450-1d4bb121e1c3">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b30444bc-b440-4396-b3ce-d70c3c684ecb">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a8b47c-9cae-4633-adb3-391049c640d5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed075445-26f4-452d-905d-f3e2e3ebdb25">
    <name>ЗаданиеВыполняет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa7fd4d4-d68f-4ceb-ac95-6650eaa94338">
    <name>ДатаВремяРейсаФактПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b9fe414-2272-4679-94d0-f2aad4a40f51">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63702177-349b-4d17-bf16-d6891f186bf0">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f447f68b-e419-49e0-b86a-301f0e7980f4">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42877410-8859-4810-b356-14180c6fd9e4">
    <name>ДатаВремяРейсаФактС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f4077b4-3d45-4d14-9d79-cb03f40f871f">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f2c1a2e-cb86-4455-90e2-890834134774">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="fc7e7f69-66c0-4524-9af0-f84439c47b6b">
    <name>Распоряжения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="89a28c00-b22c-4a61-a9e9-df53927e4978">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d1923f33-8770-4a7e-892d-1ea3c4e90ad1">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b7d67d85-7e2c-4e0f-bebe-c31e9180e68f">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb6ed3da-0d41-46c3-b5dd-b9fb617c075e">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4f2eb382-0750-4b94-8d10-6be4259cccd6">
      <name>ПолучательОтправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="15b3905e-1f40-4d8c-9f31-cde2f3907a9e">
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="53fe645f-571c-4df4-ade9-2ee78eb589c6">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="73f69371-efc1-411d-88e3-a54d75fca5fe">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9b978cb-d533-4778-a7c0-4c5b981f0cf2">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4a9b3cc0-c14f-42c9-853f-2377c4e71c15">
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="68fb98bd-34a2-44b6-bb6f-97d8ec682ff2">
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d39b5bf7-ae63-4518-9a48-f9131061ff6a">
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f72237d5-29a8-4168-a456-39b76513b45b">
      <name>Зона</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f0e45492-af13-445e-b5d6-a94ca1031eed">
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Catalogs/ВариантыКомплектацииНоменклатуры/ВариантыКомплектацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ce49200-30ea-44d6-97f7-390bc2c5dee9">
  <name>ВариантыКомплектацииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Номенклатура</owners>
  <tabularSections extendedConfigurationObject="354a86ec-cf4f-4299-a60e-80a77f619e67">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6219b3de-db0c-4d3e-b4f2-58419c6950a0">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5f89eb00-a169-4f6d-b578-df09d9d8a64e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f089d29-db58-4577-966e-b19048e606cd">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаКлиенте
Процедура ОД_ПослеЗаписиПосле(ПараметрыЗаписи)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаСервере
Процедура ОД_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// 17.05.2026 /100/
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Не объединять реализации", Истина);
	ФлагНеОбъединяитьРеализации = УправлениеСвойствами.ЗначениеСвойства(Объект.Партнер, Свойство);
	Если ФлагНеОбъединяитьРеализации <> Неопределено 
		И ФлагНеОбъединяитьРеализации Тогда
		ОснованияКоличество = ОснованияКоличество(Объект.Ссылка);
		Если ОснованияКоличество > 1 Тогда
			Отказ = Истина;
			Сообщить("Не объединять реализации по нескольким заказам клиента!!!");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОД_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаКлиенте
&После("ОбработкаВыбораПодборНаКлиенте")
Процедура ОД_ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)


	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

&НаСервере
&После("ПриУдаленииКомплектующихНаСервере")
Процедура ОД_ПриУдаленииКомплектующихНаСервере(ИмяТЧ, ДополнительныйПараметр)

	ЗаполнитьНаборыКомплекты();

КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
&Вместо("Подключаемый_ВыполнитьКоманду")
Процедура ОД_Подключаемый_ВыполнитьКоманду(Команда)

	ИмяПФ = "ЗаявкаАвтотранспортаВер2";
	
	Если Команда.Имя = "ПодменюПечатьОбычное_" + ИмяПФ Тогда
		
		ДанныеЗаданиеНаПеревозку = ЗаданиеНаПеревозку(Объект.Ссылка);
		
		Если ПустаяСтрока(ДанныеЗаданиеНаПеревозку.КлючСвязи) Тогда
			Сообщить("! не определен документ Задание на перевозку");
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура();
		
		ТекущийОбъектПечати = Новый Массив;
		ТекущийОбъектПечати.Добавить(ДанныеЗаданиеНаПеревозку.ЗаданиеНаПеревозку);
		ТекущийОбъектПечати.Добавить(ДанныеЗаданиеНаПеревозку.КлючСвязи);
		
		ТекМенеджерПечати = "Обработка." + ИмяПФ;
		ИД_ПечатнойФормы = "ВнешняяПечатнаяФорма." + ИмяПФ; 
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТекМенеджерПечати, ИД_ПечатнойФормы, ТекущийОбъектПечати, ЭтотОбъект, ДополнительныеПараметры);
	Иначе	
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область НаборыКомплекты

Процедура ЗаполнитьНаборыКомплекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ_Товары.Номенклатура КАК Номенклатура,
		|	ТЗ_Товары.НоменклатураНабора КАК НоменклатураНабора,
		|	ТЗ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТЗ_Товары.СуммаСНДС КАК СуммаСНДС
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СУММА(ВТ_Товары.КоличествоУпаковок) КАК Количество,
		|	СУММА(ВТ_Товары.СуммаСНДС) КАК Сумма,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Набор,
		|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_Наборы
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВТ_Товары.НоменклатураНабора = ВариантыКомплектацииНоменклатуры.Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	ВариантыКомплектацииНоменклатуры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок) КАК КоличествоВНаборе,
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК ВариантКомплектации
		|ПОМЕСТИТЬ ВТ_ВариантыКомплектации
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Наборы.Набор КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ВТ_ВариантыКомплектации.КоличествоВНаборе <> 0
		|			ТОГДА ВТ_Наборы.Сумма / (ВТ_Наборы.Количество / ВТ_ВариантыКомплектации.КоличествоВНаборе)
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	ВТ_Наборы КАК ВТ_Наборы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВариантыКомплектации КАК ВТ_ВариантыКомплектации
		|		ПО ВТ_Наборы.ВариантКомплектации = ВТ_ВариантыКомплектации.ВариантКомплектации";
	
	Запрос.УстановитьПараметр("ТЗ_Товары", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();

	Наборы.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Наборы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	НаборыКомплектыКоличество = Наборы.Количество();

КонецПроцедуры

#КонецОбласти

#Область Дополнительно

Функция ПолучитьЗаказКлиента(п_Реализация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Ссылка = &Реализация
		|		И РеализацияТоваровУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		РеализацияТоваровУслугТовары.ЗаказКлиента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|	ГДЕ
		|		РеализацияТоваровУслугТовары.Ссылка = &Реализация
		|		И РеализацияТоваровУслугТовары.Ссылка.Проведен) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.ЗаказКлиента.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Реализация", п_Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказКлиента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ()

Функция ЗаданиеНаПеревозку(п_Реализация)
	
	Рез = Новый Структура();
	Рез.Вставить("ЗаданиеНаПеревозку", "");
	Рез.Вставить("КлючСвязи", "");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК ЗаданиеНаПеревозку,
		|	ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи КАК КлючСвязи
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	
	
	ТекЗаказКлиента = ПолучитьЗаказКлиента(п_Реализация);
	
	Если НЕ ЗначениеЗаполнено(ТекЗаказКлиента) Тогда
		Возврат Рез;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Распоряжение", ТекЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ()

Функция ОснованияКоличество(п_Реализация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", п_Реализация);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать().Количество();

КонецФункции // ()

#КонецОбласти
